[
  {
    "title": "i_folder",
    "varId": "i_folder_in_root",
    "dataType": "Folder",
    "children": [
      {
        "title": "some_text",
        "varId": "i_text_in_folder",
        "dataType": "Text",
        "metadata": {
          "find risk take": "She beat get staff after continue remember. Chance ever customer main.",
          "up": "Policy personal would theory another type. Item position recently time single consider question notice. Reveal one ready fish arm. East each surface high piece teach society.",
          "by social forward": "Act little join business late century third. Car turn accept administration class. Senior finally determine name.",
          "difference find opportunity": "Begin list court. Ability knowledge human theory. They fine response include girl more.",
          "home": "Because night nearly task during. They different light girl woman after computer."
        },
        "sources": [
          "source_1_for_i_text_in_folder"
        ]
      },
      {
        "title": "some_int",
        "varId": "i_int_in_folder",
        "dataType": "Integer",
        "metadata": {
          "order chance machine": "While argue business college garden. Pretty her population yourself against report something. Which leader economy question current left.",
          "stage": "Group no campaign brother under him remain idea. Whole exist crime nothing together.",
          "admit": "Bill life benefit job soon camera. Thus election color. Your this set behavior operation argue seven safe.",
          "set her": "Store cell interview skill. Out a region product. Out believe without close much front.",
          "fear player knowledge": "Artist others summer occur design produce us attention. Account to player prepare. List southern hope like."
        },
        "sources": [
          "source_1_for_i_int_in_folder"
        ]
      },
      {
        "title": "simple_list",
        "varId": "i_list_in_folder",
        "dataType": "List",
        "children": [
          {
            "title": "some_int",
            "varId": "i_int_in_list_in_folder",
            "dataType": "Integer"
          },
          {
            "title": "some_text",
            "varId": "i_text_in_list_in_folder",
            "dataType": "Text"
          }
        ]
      }
    ]
  },
  {
    "title": "simple_list",
    "varId": "i_list_in_root",
    "dataType": "List",
    "children": [
      {
        "title": "some_text",
        "varId": "i_text_in_list",
        "dataType": "Text",
        "metadata": {
          "policy agent": "Fight note religious without nice station. Minute recent poor economy operation share around. Share major around build imagine summer employee.",
          "leave": "Movie morning too official building if friend. Season fish middle. American size book trouble pattern field. Realize whatever agency sense similar.",
          "usually food": "Site she field dinner common. Participant energy see town.",
          "quality": "Himself office cover political ability record today attack. Safe never loss girl.",
          "rich believe": "Individual address election trip. Office our beautiful television happy.",
          "throw bad": "Fall report here. Spend that game fund themselves tough size. Avoid boy speak want increase forward."
        }
      }
    ],
    "metadata": {
      "free along": "Animal cause gun. Because create cell ground glass carry.",
      "who factor second": "Focus travel store parent us. Including then nice buy better home.",
      "common part ahead": "Third nor billion hope make. Arm few ok huge fire. Court charge place reduce ready method.",
      "child kind land": "Produce out travel letter. Recently eat place relationship woman right knowledge. Sound organization why."
    },
    "sources": [
      "source_1_for_i_list_in_root"
    ]
  },
  {
    "title": "simple_keyed_list",
    "varId": "i_keyed_list_in_root",
    "dataType": "KeyedList",
    "children": [
      {
        "title": "some_text",
        "varId": "i_text_in_keyed_list",
        "dataType": "Text",
        "metadata": {
          "machine goal": "Sense method grow piece identify each sister trade. Word admit local commercial economic.",
          "realize detail north": "Rest describe under hour culture require price. Year dark if require since. Election base case walk mission deal.",
          "clearly shoulder pass": "They toward today during mission great begin feeling. Improve recent almost source.",
          "ahead pay attorney": "Spend may leave behavior the. Media degree treat finally born.",
          "speech red remain": "Industry gun production after know create.",
          "seven": "Yeah book guy become a employee he. Cost consumer provide keep. Who talk fine certain economic want."
        },
        "sources": [
          "source_1_for_i_text_in_keyed_list"
        ]
      },
      {
        "title": "some_int",
        "varId": "i_int_in_keyed_list",
        "dataType": "Integer",
        "metadata": {
          "similar continue": "Either outside these perhaps. Question his eye hospital art red.",
          "former learn like": "Usually prepare site there theory who dark. Teacher without although buy learn seem send moment.",
          "serious information glass": "Fire still team voice work. Run family moment happy to gas. Development fill analysis else national investment say.",
          "section lot activity": "Anything which expert news again arrive between dinner.",
          "sign": "Executive if pass job knowledge cell. Hospital themselves chance remember gas.",
          "hair soon": "Degree own fight history practice view. However large involve support some exist.",
          "than current": "Year of cut.",
          "party response worry": "Condition attention trade campaign.",
          "play": "Dark hundred instead service. Population carry really avoid believe."
        }
      }
    ],
    "metadata": {
      "learn program out": "Top piece staff stay series clear article collection. Resource history PM none. Song experience democratic idea lot.",
      "simple": "Forward light crime name actually human.",
      "body author": "Still rest they part apply level five. Arm age could week international civil eat. Attention wrong particularly think enter feel.",
      "yeah great money": "Responsibility pick air son. Manage only by.",
      "do against": "Unit outside bill activity property. Change town so team effort less.",
      "hear individual central": "Score better skin myself live. Feeling speech air center. Air clear computer general stay."
    },
    "sources": [
      "source_1_for_i_keyed_list_in_root",
      "source_2_for_i_keyed_list_in_root"
    ]
  },
  {
    "title": "outer_list",
    "varId": "i_outer_nested_list",
    "dataType": "List",
    "children": [
      {
        "title": "some_text",
        "varId": "i_text_in_outer_nested_list",
        "dataType": "Text",
        "metadata": {
          "stay drive your": "Discuss act low race whom once. Development visit base source. Weight cost government sell boy central painting. Area manager production moment.",
          "tough": "Account investment culture close notice. Job ever detail seek middle question.",
          "partner": "Miss eye area national majority degree. Voice forget foreign hard social.",
          "truth house": "Loss rock although television. Gas air audience lose science. Parent dream response two. Fish lead pick yes question successful.",
          "north": "Cut throw fire affect sister. Its property south economic Republican when successful.",
          "three Republican high": "Street challenge once be really. Others goal weight represent.",
          "mission": "Brother action president reveal science. Might line focus close lay current level.",
          "court result place": "Market send threat local right. Decide score main answer show our add.",
          "according": "Nor him analysis my traditional win large adult. Whole impact teacher. Region provide argue per.",
          "tell": "Food mission possible than. Sister sure around after sister."
        }
      },
      {
        "title": "inner_list",
        "varId": "i_inner_nested_list",
        "dataType": "List",
        "children": [
          {
            "title": "some_text",
            "varId": "i_text_in_inner_nested_list",
            "dataType": "Text",
            "sources": [
              "source_1_for_i_text_in_inner_nested_list"
            ]
          },
          {
            "title": "a_keyed_list",
            "varId": "i_keyed_list_in_inner_nested_list",
            "dataType": "KeyedList",
            "children": [
              {
                "title": "some_text",
                "varId": "i_text_in_keyed_list_in_inner_nested_list",
                "dataType": "Text",
                "sources": [
                  "source_1_for_i_text_in_keyed_list_in_inner_nested_list"
                ]
              }
            ]
          }
        ],
        "metadata": {
          "result gas exist": "Rise seat follow on into situation anyone. Stand feel force race occur station.",
          "book": "Minute safe mission from concern.",
          "artist": "Store actually show hope statement employee region. Hit before get add. Leg phone idea of reveal law.",
          "federal turn": "Even wear eye this unit bring. Product why administration since guess own. Notice relationship whole. Under out around class sort prepare event rise.",
          "others wrong": "Fine chance sister wind.",
          "thousand go": "Might where course left particular tax attention early. Study sense above. Accept source trade behavior or.",
          "course light security": "Candidate catch gas can. System party radio resource child.",
          "treatment meet choice": "Response ago energy plant general material local. Summer between tree think off. People result share require clearly program head.",
          "assume gas reveal": "Pressure us enough left institution where. Operation hundred relationship garden be. East peace sea page cup radio."
        },
        "sources": [
          "source_1_for_i_inner_nested_list"
        ]
      }
    ],
    "metadata": {
      "local arm": "Natural usually his everything. Politics take shake real concern. Government field though he.",
      "value": "Information according attorney cultural. Rule realize by meet recently science he important.",
      "front": "A safe hair choice.",
      "will": "Rest surface moment great agent. Mind sometimes position data become.",
      "instead": "Meet recent law seek produce spring. Nature stop role contain high. Strong learn now under city business lay.",
      "through": "Operation help role care.",
      "material": "A very project movie alone soon attorney. Individual allow more day news way."
    }
  },
  {
    "title": "outer_keyed_list",
    "varId": "i_outer_nested_keyed_list",
    "dataType": "KeyedList",
    "children": [
      {
        "title": "some_text",
        "varId": "i_text_in_outer_nested_keyed_list",
        "dataType": "Text",
        "metadata": {
          "conference member": "Man pattern sort mind bar figure wait.",
          "worker it give": "Design style bank. Enjoy everybody figure area. Public interest heart production. Star us process generation itself simply anyone.",
          "environment": "Option citizen then owner natural shake manage give.",
          "within big class": "Side for land mission fish say start. Occur science according visit Mrs official avoid.",
          "class back third": "Cup though year author ahead pressure over.",
          "next": "Foreign source town form that American. Prove year her career reality early.",
          "wonder": "It compare allow space. Campaign watch final expect.",
          "top goal": "Office tree argue. Kitchen continue Mr available."
        }
      },
      {
        "title": "inner_keyed_list",
        "varId": "i_inner_nested_keyed_list",
        "dataType": "KeyedList",
        "children": [
          {
            "title": "some_text",
            "varId": "i_text_in_inner_nested_keyed_list",
            "dataType": "Text",
            "metadata": {
              "brother boy southern": "Environment stay trial religious side rather special action. Decide discover in attention. Course history amount big between.",
              "college matter": "Action artist fall. Economic several trouble officer. Tonight method blood force race yes theory.",
              "language ahead": "Word where resource truth most later. Scientist catch score purpose sort task possible.",
              "add wall perform": "Guess scene grow at can. Wish foreign explain TV treatment company individual central.",
              "west mouth however": "Job early determine. Main red coach we against production.",
              "family born summer": "Decade blue score between whole during stuff. Tough nation her sell. Stop real lead once husband.",
              "rich": "Find former recently almost mouth game expert. Agree side lot sound more.",
              "article whatever": "Through ahead visit entire our. Agreement series police peace poor. Perform floor decide popular reduce everybody.",
              "firm": "Government firm film positive. Amount store save image cup. Story idea site someone people PM why themselves."
            }
          },
          {
            "title": "a_list",
            "varId": "i_list_in_inner_nested_keyed_list",
            "dataType": "List",
            "children": [
              {
                "title": "some_text",
                "varId": "i_text_in_list_in_inner_nested_keyed_list",
                "dataType": "Text",
                "metadata": {
                  "mission property": "Health class ready fund. Ahead allow artist.",
                  "treat increase": "Really edge world receive leg watch. Likely bar wind speak small. Improve station choice already less.",
                  "expert turn": "Address collection floor music glass language. Policy avoid feeling gun write.",
                  "tree key group": "Education water relationship bill down. Yet doctor any central. Task effort structure me. Her young begin responsibility know modern theory.",
                  "myself result": "This its reality.",
                  "apply her experience": "Class claim road analysis imagine. Future performance feel decide week. Able girl successful better hundred low usually."
                }
              },
              {
                "title": "yet_another_keyed_list",
                "varId": "i_keyed_list_in_list_in_inner_nested_keyed_list",
                "dataType": "KeyedList",
                "children": [
                  {
                    "title": "some_text",
                    "varId": "i_text_in_keyed_list_in_list_in_inner_nested_keyed_list",
                    "dataType": "Text"
                  }
                ],
                "metadata": {
                  "issue": "Door huge difference tonight not fly surface fish. Yes quality energy hotel participant.",
                  "new less": "Other amount not pretty. Us age anything customer resource campaign.",
                  "inside and think": "Decade card idea want. Similar sound because each. Right turn raise man first any face present. Analysis value baby best house I college.",
                  "class public method": "Require candidate southern paper firm break season individual. Feeling thing concern."
                },
                "sources": [
                  "source_1_for_i_keyed_list_in_list_in_inner_nested_keyed_list",
                  "source_2_for_i_keyed_list_in_list_in_inner_nested_keyed_list",
                  "source_3_for_i_keyed_list_in_list_in_inner_nested_keyed_list",
                  "source_4_for_i_keyed_list_in_list_in_inner_nested_keyed_list"
                ]
              }
            ],
            "sources": [
              "source_1_for_i_list_in_inner_nested_keyed_list",
              "source_2_for_i_list_in_inner_nested_keyed_list"
            ]
          }
        ],
        "metadata": {
          "direction": "Risk every general successful own. Forward media organization hundred good film. Ball record talk help standard environmental garden. Including give bank eight develop.",
          "population": "Safe my represent likely personal performance thing. Away fund science song pretty. Scene lawyer morning of history. Science spend these.",
          "police": "These occur agree return. Green benefit soldier her kitchen hair near. Spring pass maintain community.",
          "church indeed": "Where part wonder defense. Identify hand customer name evening section.",
          "leg drug": "Experience bag offer finish. Community letter life out meet song scientist. Firm customer citizen traditional. Same situation family improve seem chair.",
          "reason contain": "Near resource lay production. Occur in expert parent apply build.",
          "fund color": "Eat method do great blue live. Star note respond anyone affect. Result opportunity course tree blood knowledge middle.",
          "return guess": "Oil end truth effect building firm increase. Note guy spring gas above about campaign."
        },
        "sources": [
          "source_1_for_i_inner_nested_keyed_list",
          "source_2_for_i_inner_nested_keyed_list",
          "source_3_for_i_inner_nested_keyed_list"
        ]
      }
    ]
  },
  {
    "title": "never_populated",
    "varId": "i_text_never_populated",
    "dataType": "Text"
  }
]